In [16]:
import pandas as pd

In [17]:
data = {'2020': [966845,3391946,2942828,1450062,],
        '2010': [10312545, 3567910,2758296,1454636 ]}
data

{'2020': [966845, 3391946, 2942828, 1450062],
 '2010': [10312545, 3567910, 2758296, 1454636]}

In [18]:
dataFrame = pd.DataFrame(data)
dataFrame

      2020      2010
0   966845  10312545
1  3391946   3567910
2  2942828   2758296
3  1450062   1454636

In [19]:
df = pd.DataFrame(data,index = ['서울','부산','인천','광주'])
df

       2020      2010
서울   966845  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [21]:
data2 = [[9668465, 3391946, 2942828, 1450062],
        [10312545, 3567910, 2758296, 1454636]]
ind = [ '2020','2010' ]
col = ["서울", "부산", "인천" , "광주"]

df2 = pd.DataFrame(data2, index = ind, columns = col)
df2

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636

In [22]:
#DataFrame 전치하기
df2.T

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [25]:
df.columns

Index(['2020', '2010'], dtype='object')

In [30]:
df[['2020','2010']] # column까지 다 출력

       2020      2010
서울   966845  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [28]:
df['2020']

서울     966845
부산    3391946
인천    2942828
광주    1450062
Name: 2020, dtype: int64

In [31]:
df['2005'] = [9762546,3512547,2517680,1456016]
df

       2020      2010     2005
서울   966845  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680
광주  1450062   1454636  1456016

In [38]:
df['서울':'부산']

       2020      2010     2005
서울   966845  10312545  9762546
부산  3391946   3567910  3512547

In [37]:
df[0:2]

       2020      2010     2005
서울   966845  10312545  9762546
부산  3391946   3567910  3512547

In [44]:
#loc[] # With name of index, bring row

df.loc['부산':'인천','2020':'2010']


# iloc[]
df.iloc[3] #row에 속한 values를 가지고 올 수 있다.

2020    1450062
2010    1454636
2005    1456016
Name: 광주, dtype: int64

In [46]:
df[df['2020']>=2500000]

       2020     2010     2005
부산  3391946  3567910  3512547
인천  2942828  2758296  2517680